// visual_hack.cpp : Этот файл содержит функцию "main". Здесь начинается и заканчивается выполнение программы.
//

#include "pch.h"

#include "source/engine.h"
#include "source/exception.h"
#include "source/time.h"


int main(const int argc, char* argv[]) noexcept
{
	try
	{
		if (argc < 2)
		{
			return 0;
		}
				
		mtl::engine::funcs.at(argv[1])();
		
		
	}
	catch (const error::c_win_api_exception & er)
	{
		std::wcout << er.GetMessageW() <<std::endl;
		
	}
	catch(...)
	{
		std::cout << "Error!" << std::endl;
		
	}
	    
}

// Запуск программы: CTRL+F5 или меню "Отладка" > "Запуск без отладки"
// Отладка программы: F5 или меню "Отладка" > "Запустить отладку"

// Советы по началу работы 
//   1. В окне обозревателя решений можно добавлять файлы и управлять ими.
//   2. В окне Team Explorer можно подключиться к системе управления версиями.
//   3. В окне "Выходные данные" можно просматривать выходные данные сборки и другие сообщения.
//   4. В окне "Список ошибок" можно просматривать ошибки.
//   5. Последовательно выберите пункты меню "Проект" > "Добавить новый элемент", чтобы создать файлы кода, или "Проект" > "Добавить существующий элемент", чтобы добавить в проект существующие файлы кода.
//   6. Чтобы снова открыть этот проект позже, выберите пункты меню "Файл" > "Открыть" > "Проект" и выберите SLN-файл.
